{
    "0": "If artificial intelligence surpasses human intelligence, should it have rights?",
    "1": "Is it ethical to develop technologies that replace human jobs if they increase overall efficiency?",
    "2": "At what point does data collection become digital surveillance, even if it's 'opt-in'?",
    "3": "Do we have free will, or is every decision shaped by prior experiences and biology?",
    "4": "If a copy of you was made with the exact same memories and personality, is it still 'you'?",
    "5": "Can morality exist without religion or culture?",
    "6": "Is national identity becoming obsolete in a globalized world?",
    "7": "Should individuals have the right to erase their online past completely?",
    "8": "How does the algorithmic curation of content shape our worldviews without us realizing it?",
    "9": "Will humanity ever agree on a universal definition of 'progress'?",
    "10": "If immortality becomes possible through technology, who should get access to it?",
    "11": "Would we be more peaceful if we knew Earth was being watched by a more advanced civilization?",
    "12": "What’s more important: living a happy life or a meaningful one?",
    "13": "Would you still strive for your goals if you knew you were guaranteed to fail?",
    "14": "If no one remembered anything you did in life, would it still matter to do it?",
    "15": "Should future generations have legal rights today when it comes to environmental decisions?",
    "16": "Is it ever justifiable to harm nature for the sake of human progress?",
    "17": "If climate change were instantly and visibly painful to individuals, would we act faster?",
    "18": "Does the traditional education system kill creativity more than it fosters intelligence?",
    "19": "Should emotional intelligence be valued more than academic achievement in schools?",
    "20": "If you could learn any skill instantly, what would it be — and would that change its value?",
    "21": "Can a society truly be meritocratic if wealth is inherited?",
    "22": "Is universal basic income a path to freedom — or laziness?",
    "23": "What happens to ambition in a world where everything essential is guaranteed?",
    "24": "If time travel were possible, should it be regulated — or even allowed at all?",
    "25": "Does the present moment even exist, or is it just a moving illusion?",
    "26": "Would life have more meaning if you only had 30 years to live instead of 80?",
    "27": "Is it better to be deeply loved by one person or liked by many?",
    "28": "Why do we sometimes hurt the people we love the most?",
    "29": "Is unconditional love actually possible, or is it a romantic ideal?",
    "30": "If AI can create beautiful art, is the human artist still necessary?",
    "31": "Does the meaning of art come from the creator — or from the audience interpreting it?",
    "32": "How much of our thinking is shaped by the language we speak?",
    "33": "If two people speak the same language but have different values, are they truly understanding each other?",
    "34": "Should people have the right to genetically modify their children?",
    "35": "Is the pursuit of perfect health becoming a modern form of obsession?",
    "36": "Can you truly control your emotions, or just manage their expression?",
    "37": "Is it possible to be too self-aware?",
    "38": "If we discover intelligent alien life, how would that change what it means to be human?",
    "39": "Should we prioritize exploring space when we haven’t solved problems on Earth yet?",
    "40": "Is religion more about truth — or belonging?",
    "41": "Can spirituality exist without any belief in the supernatural?",
    "42": "Should the law always reflect morality — or can they be separate?",
    "43": "If someone commits a crime out of desperation, is justice the same as punishment?",
    "44": "Are humans inherently good, or do we learn morality over time?"
  }
  